In [35]:
import pandas as pd
import numpy as np
from scipy import stats

### Zadanie 5.1

In [36]:
dataset1 = pd.DataFrame(np.array([[None,None,None], [None,None,None], [None,None,None],
            [None,None,None], [None,None,None],
            [None,None,None], [None,None,None]]),
    index=['1r', '2r', '3r', '4r',
            '5r', '6r', '7r'],
    columns=['1c', '2c', '3c'])
print(dataset1)

i = 1
for row, value in dataset1.iterrows():
    value[0] = i
    value[1] = i + 7
    if value[0] % 2:
        value[2] = value[0]
    else:
        value[2] = value[1]

    i = i + 1

print(dataset1)

      1c    2c    3c
1r  None  None  None
2r  None  None  None
3r  None  None  None
4r  None  None  None
5r  None  None  None
6r  None  None  None
7r  None  None  None
   1c  2c  3c
1r  1   8   1
2r  2   9   9
3r  3  10   3
4r  4  11  11
5r  5  12   5
6r  6  13  13
7r  7  14   7

/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:11: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  value[0] = i
/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:12: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  value[1] = i + 7
/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:13: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  if value[0] % 2:
/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:14: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  value[2] = value[0]
/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:14: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  value[2] = value[0]
/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:16: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  value[2] = value[1]
/var/folders/07/ww1l5ht56ps_qjvqynpygtbh0000gn/T/ipykernel_57390/752552153.py:16: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  value[2] = value[1]

In [37]:
dataset1.mean()
dataset1.median()
dataset1.mode()
dataset1.var()
dataset1.std()
dataset1.max() - dataset1.min()

1c     6
2c     6
3c    12
dtype: object

### Zadanie 5.2

In [38]:
dataset1

   1c  2c  3c
1r  1   8   1
2r  2   9   9
3r  3  10   3
4r  4  11  11
5r  5  12   5
6r  6  13  13
7r  7  14   7

In [39]:
dataset1.head()
dataset1[0:5]
dataset1.tail(3) 
dataset1[-3:]
dataset1.iloc[1,1]
dataset1['2c'].loc[['2r']]
dataset1.iloc[1::-1, :2]
dataset1[['1c', '2c']].iloc[1::-1]
dataset1[['1c', '2c']].loc[['2r', '1r']]
dataset1.iloc[0:2, -2:]
dataset1.loc[['1r','2r']][['2c','3c']]

   2c 3c
1r  8  1
2r  9  9

### Zadanie 5.3

In [48]:
np.median(dataset1.head(1))
np.median(dataset1.tail(1))
np.mean(dataset1.head(2))
np.mean(dataset1.iloc[0:2, -2:])
np.mean(dataset1.iloc[-3:, 0:2])
#stats.mode(dataset1)
np.max(dataset1.iloc[0])

8

### Zadanie 5.4

In [62]:
dataset1[(dataset1['1c']>=5) & (dataset1['1c']<10)]
dataset1[(dataset1['2c']==5) ^ (dataset1['3c']==5)]

   1c  2c 3c
5r  5  12  5

### Zadanie 5.5

In [63]:
dataset2 = pd.read_csv('student-mat.csv')

### Zadanie 5.5

In [64]:

for i, r in dataset2.iterrows():
    if i == 10:
        break
    print(i+1, '\n', r[['sex','age']], '\n')

1
 sex     F
age    18
Name: 0, dtype: object

2
 sex     F
age    17
Name: 1, dtype: object

3
 sex     F
age    15
Name: 2, dtype: object

4
 sex     F
age    15
Name: 3, dtype: object

5
 sex     F
age    16
Name: 4, dtype: object

6
 sex     M
age    16
Name: 5, dtype: object

7
 sex     M
age    16
Name: 6, dtype: object

8
 sex     F
age    17
Name: 7, dtype: object

9
 sex     M
age    15
Name: 8, dtype: object

10
 sex     M
age    15
Name: 9, dtype: object

### Zadanie 5.6

In [114]:
# a)
dataset2.filter(['sex', 'age'])

    sex  age
0     F   18
1     F   17
2     F   15
3     F   15
4     F   16
..   ..  ...
390   M   20
391   M   17
392   M   21
393   M   18
394   M   19

[395 rows x 2 columns]

In [115]:
# b)
dataset2.filter(regex='^G')

     G1  G2  G3
0     5   6   6
1     5   5   6
2     7   8  10
3    15  14  15
4     6  10  10
..   ..  ..  ..
390   9   9   9
391  14  16  16
392  10   8   7
393  11  12  10
394   8   9   9

[395 rows x 3 columns]

In [116]:
# c)
dataset2.filter(regex='^2', axis=0)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
20,GP,M,15,U,GT3,T,4,3,teacher,other,...,4,4,1,1,1,1,0,13,14,15
21,GP,M,15,U,GT3,T,4,4,health,health,...,5,4,2,1,1,5,0,12,15,15
22,GP,M,16,U,LE3,T,4,2,teacher,other,...,4,5,1,1,3,5,2,15,15,16
23,GP,M,16,U,LE3,T,2,2,other,other,...,5,4,4,2,4,5,0,13,13,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,GP,M,17,U,GT3,T,3,3,health,other,...,4,4,3,1,3,5,4,14,12,11
296,GP,F,19,U,GT3,T,4,4,health,other,...,2,3,4,2,3,2,0,10,9,0
297,GP,F,18,U,LE3,T,4,3,other,other,...,4,4,5,1,2,2,10,10,8,8
298,GP,F,18,U,GT3,T,4,3,other,other,...,4,3,3,1,1,3,0,14,13,14
299,GP,M,18,U,LE3,T,4,4,teacher,teacher,...,1,4,2,2,2,1,5,16,15,16

In [118]:
# d)
dataset2.filter(like='2', axis=0)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
12,GP,M,15,U,LE3,T,4,4,health,services,...,4,3,3,1,3,5,2,14,14,14
20,GP,M,15,U,GT3,T,4,3,teacher,other,...,4,4,1,1,1,1,0,13,14,15
21,GP,M,15,U,GT3,T,4,4,health,health,...,5,4,2,1,1,5,0,12,15,15
22,GP,M,16,U,LE3,T,4,2,teacher,other,...,4,5,1,1,3,5,2,15,15,16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,MS,M,18,U,LE3,T,1,3,at_home,services,...,4,3,3,2,3,3,7,8,7,8
362,MS,F,18,U,GT3,T,3,3,services,services,...,4,3,2,1,3,3,0,11,11,10
372,MS,F,17,U,GT3,T,2,2,other,at_home,...,3,4,3,1,1,3,8,13,11,11
382,MS,M,17,U,GT3,T,2,3,other,services,...,4,4,3,1,1,3,2,11,11,10
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7

In [119]:
# e)
dataset2.filter(like='job')

         Mjob      Fjob
0     at_home   teacher
1     at_home     other
2     at_home     other
3      health  services
4       other     other
..        ...       ...
390  services  services
391  services  services
392     other     other
393  services     other
394     other   at_home

[395 rows x 2 columns]

In [120]:
# f)
dataset2[dataset2['age'] >= 18]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
127,GP,F,19,U,GT3,T,0,1,at_home,other,...,3,4,2,1,1,5,2,7,8,9
128,GP,M,18,R,GT3,T,2,2,services,other,...,3,3,3,1,2,4,0,7,4,0
150,GP,M,18,U,LE3,T,1,1,other,other,...,2,3,5,2,5,4,0,6,5,0
153,GP,M,19,U,GT3,T,3,2,services,at_home,...,4,5,4,1,1,4,0,5,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
389,MS,F,18,U,GT3,T,1,1,other,other,...,1,1,1,1,1,5,0,6,5,0
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In [121]:
# g)
dataset2[(dataset2['age'] == 19) | (dataset2['age'] == 20)]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
127,GP,F,19,U,GT3,T,0,1,at_home,other,...,3,4,2,1,1,5,2,7,8,9
153,GP,M,19,U,GT3,T,3,2,services,at_home,...,4,5,4,1,1,4,0,5,0,0
210,GP,F,19,U,GT3,T,3,3,other,other,...,4,3,3,1,2,3,10,8,8,8
257,GP,M,19,U,LE3,A,4,3,services,at_home,...,4,3,1,1,1,1,12,11,11,11
270,GP,F,19,U,GT3,T,3,3,other,services,...,4,3,5,3,3,5,15,9,9,9
296,GP,F,19,U,GT3,T,4,4,health,other,...,2,3,4,2,3,2,0,10,9,0
304,GP,M,19,U,GT3,T,3,3,other,other,...,4,4,4,1,1,3,20,15,14,13
306,GP,M,20,U,GT3,A,3,2,services,other,...,5,5,3,1,1,5,0,17,18,18
307,GP,M,19,U,GT3,T,4,4,teacher,services,...,4,3,4,1,1,4,38,8,9,8
308,GP,M,19,R,GT3,T,3,3,other,services,...,4,5,3,1,2,5,0,15,12,12
309,GP,F,19,U,LE3,T,1,1,at_home,other,...,4,4,3,1,3,3,18,12,10,10
310,GP,F,19,U,LE3,T,1,2,services,services,...,4,2,4,2,2,3,0,9,9,0
311,GP,F,19,U,GT3,T,2,1,at_home,other,...,3,4,1,1,1,2,20,14,12,13
312,GP,M,19,U,GT3,T,1,2,other,services,...,4,5,2,2,2,4,3,13,11,11
313,GP,F,19,U,LE3,T,3,2,services,other,...,4,2,2,1,2,1,22,13,10,11
314,GP,F,19,U,GT3,T,1,1,at_home,health,...,4,1,2,1,1,3,14,15,13,13
315,GP,F,19,R,GT3,T,2,3,other,other,...,4,1,2,1,1,3,40,13,11,11
336,GP,F,19,R,GT3,A,3,1,services,at_home,...,5,4,3,1,2,5,12,14,13,13
340,GP,F,19,U,GT3,T,2,1,services,services,...,4,3,4,1,3,3,4,11,12,11
350,MS,M,19,R,GT3,T,1,1,other,services,...,5,4,4,3,3,2,8,8,7,8
353,MS,M,19,R,GT3,T,1,1,other,other,...,4,4,4,3,3,5,4,8,8,8
370,MS,F,19,U,LE3,T,3,2,services,services,...,3,2,2,1,1,3,4,7,7,9
376,MS,F,20,U,GT3,T,4,2,health,other,...,5,4,3,1,1,3,4,15,14,15
383,MS,M,19,R,GT3,T,1,1,other,services,...,4,3,2,1,3,5,0,6,5,0
387,MS,F,19,R,GT3,T,2,3,services,other,...,5,4,2,1,2,5,0,7,5,0
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In [122]:
# h)
dataset2[(dataset2['age'] == 20) & (dataset2['sex'] == 'M')]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
306,GP,M,20,U,GT3,A,3,2,services,other,...,5,5,3,1,1,5,0,17,18,18
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9

In [123]:
# i)
dataset2.filter(['age']).sort_values(by='age')

     age
130   15
102   15
103   15
104   15
105   15
..   ...
376   20
306   20
390   20
392   21
247   22

[395 rows x 1 columns]

In [124]:
# j)
dataset2.sort_index(axis=1)

,Dalc,Fedu,Fjob,G1,G2,G3,Medu,Mjob,Pstatus,Walc,...,internet,nursery,paid,reason,romantic,school,schoolsup,sex,studytime,traveltime
0,1,4,teacher,5,6,6,4,at_home,A,1,...,no,yes,no,course,no,GP,yes,F,2,2
1,1,1,other,5,5,6,1,at_home,T,1,...,yes,no,no,course,no,GP,no,F,2,1
2,2,1,other,7,8,10,1,at_home,T,3,...,yes,yes,yes,other,no,GP,yes,F,2,1
3,1,2,services,15,14,15,4,health,T,1,...,yes,yes,yes,home,yes,GP,no,F,3,1
4,1,3,other,6,10,10,3,other,T,2,...,no,yes,yes,home,no,GP,no,F,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,4,2,services,9,9,9,2,services,A,5,...,no,yes,yes,course,no,MS,no,M,2,1
391,3,1,services,14,16,16,3,services,T,4,...,yes,no,no,course,no,MS,no,M,1,2
392,3,1,other,10,8,7,1,other,T,3,...,no,no,no,course,no,MS,no,M,1,1
393,3,2,other,11,12,10,3,services,T,4,...,yes,no,no,course,no,MS,no,M,1,3
394,3,1,at_home,8,9,9,1,other,T,3,...,yes,yes,no,course,no,MS,no,M,1,1

### Zadanie 5.7

In [131]:
# a)
print('number of students: \t', dataset2['school'].count())
print('number of women: \t', dataset2[dataset2['sex'] == 'F']['sex'].count())
print('number of men: \t\t', dataset2[dataset2['sex'] == 'M']['sex'].count())

number of students: 	 395
number of women: 	 208
number of men: 		 187

In [145]:
# b)
print('avarage age of students:', dataset2['age'].mean())
print('avarage age of women: \t', dataset2[dataset2['sex'] == 'F']['age'].mean())
print('avarage age of men: \t', dataset2[dataset2['sex'] == 'M']['age'].mean())

avarage age of students: 16.696202531645568
avarage age of women: 	 16.73076923076923
avarage age of men: 	 16.657754010695186

In [167]:
dataset3 = pd.DataFrame(np.array([[dataset2[dataset2['sex'] == 'F']['sex'].count(), 
                                   dataset2[dataset2['sex'] == 'F']['age'].mean()], [
                                   dataset2[dataset2['sex'] == 'M']['sex'].count(), 
                                   dataset2[dataset2['sex'] == 'M']['age'].mean()]]),
    index=['M', 'F'],
    columns=['number', 'avg_age'])
dataset3.index.name = 'sex'
dataset3['avg_age'] = dataset3['avg_age'].round(2)
dataset3

     number  avg_age
sex
M     208.0    16.73
F     187.0    16.66

### Zadanie 5.8

In [168]:
dataset4 = dataset2.pivot_table(index='school', columns='sex', values='age', aggfunc='median')
dataset4

sex        F     M
school
GP      16.0  16.0
MS      18.0  18.0

In [169]:
dataset4.T

school    GP    MS
sex
F       16.0  18.0
M       16.0  18.0